# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k),
# не превосходящие числа N.

i = int(input('введите число: '))
p = int = 1
while p <= i:
    print(p)
    p = p*2
